const info=
[
    {
        title:'Git',
        data:
        [
            {
                subtitle :'Створити',
                inf:
                [
                    {
                        property:'git init',
                        use:'говоримо що цю теку потрібно перетворити на репозиторій'
    
                    },
                    {
                        property:'Створити на GitHab новий репозиторій',
                        use:''
    
                    },
                    {
                        property:'git remote add origin http://git.... # URL беремо з GitHub, де створили репозиторій',
                        use:'Додавання звязку між локальним та віддаленим репозиторіями'
    
                    },
                ]
            },
            {
                subtitle :'Робота локально з Git',
                inf:
                [
                    {
    
                        property:'git add . ',
                        use:'Збережу всі змінені файли'
    
                    },
                    {
                        property:' git commit -m "add new commit"',
                        use:'створює новий коміт з вказаним описом. GIT ЗАПАМЯТАВ'
    
                    },
                    {
                        property:'git checkout 6498461516wefwef13wef1we5f номер коміту',
                        use:'дозволяє перейти до конкретного коміту'
    
                    },
                    {
                        property:'git push origin master ',
                        use:'додамо на GITHAB'
    
                    },
                ]
            },
            {
                subtitle :'Робота з Гілками',
                inf:
                [
                    {
    
                        property:'git branch ',
                        use:'покаже які гілки є на локалі * зірочкою буде відмічена та гілка в якій ми знаходимось зараз'
    
                    },
                    {
                        property:' git branch назва гілки',
                        use:'Створення нової гілки'
    
                    },
                    {
                        property:'git checkout назва гілки',
                        use:'перехід на гілку (поки що нова гілка існує лише у мене на пк)'
    
                    },
                    {
                        property:'git push origin назва гілки ',
                        use:'додамо на GITHAB (git add . git commit -m "Створено нову гілку назва гілки"   git push -u origin  назва гілки)'
    
                    },
                ]
            },
            {
                subtitle :'Об`єднання Гілок варіант 1 (Відбудеться об`єднання і додасться ОДИН кіміт що я об`єднув дві гілки)',
                inf:
                [
                    {
    
                        property:'git checkout master',
                        use:'перехід на гілку з якою хочемо зробити ОБ`ЄДНАННЯ'
    
                    },
                    {
                        property:'git merge name',
                        use:'відбудеться об`єднання гілки name з гілкою на якій я буду знаходитись'
    
                    },
                    {
                        property:'git push origin masret ',
                        use:'додамо на GITHAB'
    
                    }
                ]
            },
            {
                subtitle :'Об`єднання Гілок варіант 2 (ВВідбудеться об`єднання і додадуться ВСІ кіміти що були в гілці яку я об`єднував)',
                inf:
                [
                    {
    
                        property:'git checkout master',
                        use:'перехід на гілку з якою хочемо зробити ОБ`ЄДНАННЯ'
    
                    },
                    {
                        property:'git rebase  name',
                        use:'перемістить всі коміти із даної гілки на гілку на якій знаходжусь я'
    
                    },
                    {
                        property:'git push origin masret ',
                        use:'додамо на GITHAB'
    
                    }
                ]
            },
            {
                subtitle :'СКАСОВУВАТИ Коміт   ВИДАЛИТИ',
                inf:
                [
                    {
    
                        property:'git revert asdas87324b32ib4y32',
                        use:'Це дозволяє зберегти історію комітів, але видаляє внесені зміни.'
    
                    },
                    {
                        property:'git reset --soft ewfui777777777ew98f9ew7f',
                        use:'"відкочує" гілку до конкретного коміту, залишаючи зміни в робочому каталозі та індексі. Це дозволяє перезаписати історію комітів без втрати внесених змін.'
    
                    },
                    {
                        property:'git reset --hard ewfui777777777ew98f9ew7',
                        use:' "відкочує" гілку, але вона також скидає зміни в робочому каталозі та індексі, повертаючи їх до стану, який був в конкретному коміті. Важливо використовувати це обережно, оскільки це може втратити зміни в робочому каталозі.'
    
                    }
                ]
            },
            {
                subtitle :'Додати чужі зміни собі',
                inf:
                [
                    {
    
                        property:'git pull origin master',
                        use:'отримали нову версію і всі коміти які хтось робив тому я також зможу повернутись до того стану в якому була та людина'
    
                    }
                ]
            },
            {
                subtitle :'Завантаження чужого репозиторію',
                inf:
                [
                    {
    
                        property:'cd шлях до теки якщо я ще не в ній ',
                        use:'зайшли в теку в яку будемо клонувати чужий проєкт'
    
                    },
                    {
    
                        property:'git clone http://git......(URL проєкт який будемо клонувати)',
                        use:'створиться нова тека в мене на пк за якою буде слідкувати гіт я можу в ній працювати і поки я не запушу (явно не скажу гіту добавити) то ніяк іншим не заважаю'
    
                    }
                ]
            },
            {
                subtitle :'Перед додаванням в майстер',
                inf:
                [
                    {
    
                        property:'Потрібно запушити гілку над якою я працював',
                        use:''
    
                    },
                    {
    
                        property:'Створити на GitHub Pull requests ',
                        use:'Pull requests це запит до інших учасників проєкту, щоб вони перевірили мої зміни'
    
                    }
                ]
            },
            {
                subtitle :'Перенесення конкретного коміту у свою гілку',
                inf:
                [
                    {
    
                        property:'git checkout master',
                        use:'перемикаємось на гілку в яку будемо додавати коміт'
    
                    },
                    {
    
                        property:'git cherry-pick j324h32k4n32n43j ',
                        use:'(j324h32k4n32n43j хеш або номер того коміту який я переношу з гілки 1 можна ввести повністю або перші 7 символів'
    
                    }
                ]
            },
            {
                subtitle :'КОНФЛІКТ',
                inf:
                [
                    {
    
                        property:'Конфлікт це коли в одному файлі внесли зміни в одному рядку дві людини в різних версіях, а потім вирішили об`єднати їх в такому разі буде конфлікт який потрібно вирішити обравши якесь одне рішення або створити нове альтернативне рішення файл буде виглядати так',
                        use:'спочатку було так Hello World  <<<<<<<<HEAD 123Helo (це тещо у мене було)=========== Hello Max (це те що хтось змінив) >>>>>>>>>> master'
    
                    }
                ]
            },
            {
                subtitle :'Вирішення номер 1',
                inf:
                [
                    {
    
                        property:'Змінюю файл так як важкою за потрібне (тобто саме переходжу в файл і вношу зміни які задовольнять всіх)',
                        use:''
    
                    },
                    {
    
                        property:'роблю commit змін',
                        use:''
    
                    },
                    {
    
                        property:' роблю і merge',
                        use:''
    
                    }
    
                ]
            },
            {
                subtitle :'Вирішення номер 2',
                inf:
                [
                    {
    
                        property:'за допомогою VS Code або інші IDE',
                        use:''
    
                    }
    
                ]
            },
        ]
       

    },
    {
        title:'Info',
        data:[]
    }

    
]

export  {info};